app/controllers/rents_controller.rb

SELECT `rents`.* FROM `rents`
---
  def index
    @rents = Rent.all