app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`email`, `name`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('thathoc236@gmail.com', 'Lihn', '2019-05-27 06:44:36', '2019-05-27 06:44:36', '$2a$10$hw5LELiakcjOUOD6D2QPaeyCTlxYt.5ElDCVbL.ayX57d6vi.JHci', '$2a$10$nAPjiRQHQ.8ZsZbtXasdNOvIo3HYNXlbbeJJOoDonuob076V7b80.')